Table of Contents
 Class IdeaSpan
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaSpan : AbstractIdeaObject<IIdeaSpan>, IEquatable<AbstractIdeaObject<IIdeaSpan>>, IIdeaSpan, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaSpan>
IdeaSpan
Implements
IEquatable<AbstractIdeaObject<IIdeaSpan>>
IIdeaSpan
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaSpan>.Id
 AbstractIdeaObject<IIdeaSpan>.Name
 AbstractIdeaObject<IIdeaSpan>.Identifier
 AbstractIdeaObject<IIdeaSpan>.GetHashCode()
 AbstractIdeaObject<IIdeaSpan>.Equals(object)
 AbstractIdeaObject<IIdeaSpan>.Equals(AbstractIdeaObject<IIdeaSpan>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaSpan(Identifier<IIdeaSpan>)
public IdeaSpan(Identifier<IIdeaSpan> identifer)
Parameters
identifer Identifier<IIdeaSpan>
 IdeaSpan(int)
public IdeaSpan(int id)
Parameters
id int
 IdeaSpan(string)
public IdeaSpan(string id)
Parameters
id string
Properties
 EndCrossSection
Cross-section at the end position of the span.
public virtual IIdeaCrossSection EndCrossSection { get; set; }
Property Value
IIdeaCrossSection
 EndPosition
Relative position on the member where the span ends.
public virtual double EndPosition { get; set; }
Property Value
double
 StartCrossSection
Cross-section at the start position of the span. Must not be null.
public virtual IIdeaCrossSection StartCrossSection { get; set; }
Property Value
IIdeaCrossSection
 StartPosition
Relative position on the member where the span starts.
public virtual double StartPosition { get; set; }
Property Value
double
 Edit this page